nxp-mcuxpresso/mcux-soc-svd/MCXW727C/MCXW727C_cm33_core0.xml
        <register>
          <name>OVRD3</name>
          <description>TSM OVERRIDE REGISTER 3</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_OVRD_EN</name>
              <description>Override control for SEQ_LO_PUP_VLO_RX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_RX_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_RX_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LO_PUP_VLO_RX_OVRD to override the signal &quot;seq_lo_pup_vlo_rx&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_OVRD</name>
              <description>Override value for SEQ_LO_PUP_VLO_RX</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_OVRD_EN</name>
              <description>Override control for SEQ_LO_PUP_VLO_TX</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_TX_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_TX_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LO_PUP_VLO_TX_OVRD to override the signal &quot;seq_lo_pup_vlo_tx&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_OVRD</name>
              <description>Override value for SEQ_LO_PUP_VLO_TX</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_OVRD_EN</name>
              <description>Override control for SEQ_LO_PUP_VLO_TXDRV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_TXDRV_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_TXDRV_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LO_PUP_VLO_TXDRV_OVRD to override the signal &quot;seq_lo_pup_vlo_txdrv&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_OVRD</name>
              <description>Override value for SEQ_LO_PUP_VLO_TXDRV</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_PUP_OVRD_EN</name>
              <description>Override control for SEQ_DIVN_PUP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_DIVN_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_DIVN_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_DIVN_PUP_OVRD to override the signal &quot;seq_divn_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_DIVN_PUP_OVRD</name>
              <description>Override value for SEQ_DIVN_PUP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_OPENLOOP_OVRD_EN</name>
              <description>Override control for SEQ_DIVN_OPENLOOP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_DIVN_OPENLOOP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_DIVN_OPENLOOP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_DIVN_OPENLOOP_OVRD to override the signal &quot;seq_divn_openloop&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_DIVN_OPENLOOP_OVRD</name>
              <description>Override value for SEQ_DIVN_OPENLOOP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_OVRD_EN</name>
              <description>Override control for SEQ_PD_EN_PD_DRV</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PD_EN_PD_DRV_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PD_EN_PD_DRV_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PD_EN_PD_DRV_OVRD to override the signal &quot;seq_pd_en_pd_drv&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_OVRD</name>
              <description>Override value for SEQ_PD_EN_PD_DRV</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_OVRD_EN</name>
              <description>Override control for SEQ_CBPF_EN_DCOC</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_CBPF_EN_DCOC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_CBPF_EN_DCOC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_CBPF_EN_DCOC_OVRD to override the signal &quot;seq_cbpf_en_dcoc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_OVRD</name>
              <description>Override value for SEQ_CBPF_EN_DCOC</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_LNA_PUP_OVRD_EN</name>
              <description>Override control for SEQ_RX_LNA_PUP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_RX_LNA_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_RX_LNA_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_RX_LNA_PUP_OVRD to override the signal &quot;seq_rx_lna_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_RX_LNA_PUP_OVRD</name>
              <description>Override value for SEQ_RX_LNA_PUP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_ADC_PUP_OVRD_EN</name>
              <description>Override control for SEQ_ADC_PUP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_ADC_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_ADC_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_ADC_PUP_OVRD to override the signal &quot;seq_adc_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_ADC_PUP_OVRD</name>
              <description>Override value for SEQ_ADC_PUP</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_PUP_OVRD_EN</name>
              <description>Override control for SEQ_CBPF_PUP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_CBPF_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_CBPF_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_CBPF_PUP_OVRD to override the signal &quot;seq_cbpf_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_CBPF_PUP_OVRD</name>
              <description>Override value for SEQ_CBPF_PUP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_MIX_PUP_OVRD_EN</name>
              <description>Override control for SEQ_RX_MIX_PUP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_RX_MIX_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_RX_MIX_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_RX_MIX_PUP_OVRD to override the signal &quot;seq_rx_mix_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_RX_MIX_PUP_OVRD</name>
              <description>Override control for SEQ_RX_MIX_PUP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_RX_MIX_PUP_OVRD_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_RX_MIX_PUP_OVRD_1</name>
                  <description>Use the state of SEQ_RX_MIX_PUP_OVRD to override the signal &quot;seq_rx_mix_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_SPARE1_OVRD_EN</name>
              <description>Override control for SEQ_SPARE1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_SPARE1_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_SPARE1_OVRD_EN_1</name>
                  <description>Use the state of SEQ_SPARE1_OVRD to override the signal &quot;seq_spare1&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_SPARE1_OVRD</name>
              <description>Override value for SEQ_SPARE1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_OVRD_EN</name>
              <description>Override control for SEQ_SPARE3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_SPARE3_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_SPARE3_OVRD_EN_1</name>
                  <description>Use the state of SEQ_SPARE3_OVRD to override the signal &quot;seq_spare3&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_SPARE3_OVRD</name>
              <description>Override value for SEQ_SPARE3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MODE_OVRD_EN</name>
              <description>Override control for TX_MODE</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_MODE_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_MODE_OVRD_EN_1</name>
                  <description>Use the state of TX_MODE_OVRD to override the signal &quot;tx_mode&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MODE_OVRD</name>
              <description>Override value for TX_MODE</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MODE_OVRD_EN</name>
              <description>Override control for RX_MODE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_MODE_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_MODE_OVRD_EN_1</name>
                  <description>Use the state of RX_MODE_OVRD to override the signal &quot;rx_mode&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MODE_OVRD</name>
              <description>Override value for RX_MODE</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEAR_SHIFT_OVRD_EN</name>
              <description>Override control for GEAR_SHIFT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEAR_SHIFT_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR_SHIFT_OVRD_EN_1</name>
                  <description>Use the state of GEAR_SHIFT_OVRD to override the signal &quot;gear_shift&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEAR_SHIFT_OVRD</name>
              <description>Override value for GEAR_SHIFT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
